baseio-documents/load-test/load-test-http.txt
test222@test222-OptiPlex-9020:/var/apps/git-rep/microservices-framework-benchmark$ wrk -t32 -c128 -d10s http://localhost:8080 -s pipeline.lua --latency -- / 1024
Running 10s test @ http://localhost:8080
  32 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.01ms   32.92ms 302.53ms   67.28%
    Req/Sec    55.73k    16.97k  154.02k    70.92%
  Latency Distribution
     50%   41.33ms
     75%   68.27ms
     90%   98.86ms
     99%    0.00us
  18004042 requests in 10.10s, 2.23GB read
Requests/sec: 1783166.33
Transfer/sec:    226.17MB
test222@test222-OptiPlex-9020:/var/apps/git-rep/microservices-framework-benchmark$ wrk -t32 -c128 -d10s http://localhost:8080 -s pipeline.lua --latency -- / 2048
Running 10s test @ http://localhost:8080
  32 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    77.19ms   47.29ms 313.42ms   61.36%
    Req/Sec    57.08k    16.62k  238.23k    73.58%
  Latency Distribution
     50%   79.80ms
     75%  120.00ms
     90%  164.80ms
     99%    0.00us
  18403745 requests in 10.10s, 2.28GB read
Requests/sec: 1822808.46
Transfer/sec:    231.20MB
test222@test222-OptiPlex-9020:/var/apps/git-rep/microservices-framework-benchmark$